# RoomBaseReturnAirflowOnParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomBaseReturnAirflowOnParam Property
ParameterTypeId Class See Also
---
"Return Airflow"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomBaseReturnAirflowOnParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomBaseReturnAirflowOnParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomBaseReturnAirflowOnParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace